export const allFaqCategory = { id: 'all', name: 'Все вопросы' }

export const defaultFaqCategories = [
  { id: 'general', name: 'Общие вопросы' },
  { id: 'application', name: 'Подача документов' },
  { id: 'exams', name: 'Вступительные испытания' },
  { id: 'study', name: 'Обучение' },
  { id: 'dormitory', name: 'Общежитие' },
  { id: 'documents', name: 'Документы' }
]

export const defaultFaqs = [
  {
    id: 1,
    question: 'Является ли информация на официальном сайте Филиала www.gubkin.uz достоверной?',
    answer: 'Да, информация на официальном сайте и в телеграм канале Филиала является достоверной.',
    category: 'general',
    is_published: true
  },
  {
    id: 2,
    question: 'С какого числа начинается прием документов для приема на 1-й курс Филиала в 2026 году?',
    answer: 'Приемная комиссия принимает документы от абитуриентов с 16 июня по 1 июля 2026 года (включительно) в очном «off-line» и дистанционном «on-line» формате.',
    category: 'application',
    is_published: true
  },
  {
    id: 3,
    question: 'Экзамены будут в виде тестов?',
    answer: 'Экзамены проводятся в письменной (математика, русский язык) и устной (английский язык) форме.\n\nС образцами билетов вступительных экзаменов можно ознакомиться по ссылке: https://gubkin.ru/info/enrollee/admission_board/postupayushchim-v-bakalavriat/priyem-na-ochnuyu-formu-obucheniya/programmy-i-obraztsy-biletov-vstupitelnykh-ispytaniy.php',
    category: 'exams',
    is_published: true
  },
  {
    id: 4,
    question: 'Сколько стоит обучение?',
    answer: 'Стоимость обучения с 1 марта 2020 года составляет 28 размеров МРОТ.',
    category: 'study',
    is_published: true
  },
  {
    id: 5,
    question: 'Кому предоставляют места в Доме для проживания студентов?',
    answer: 'Места в Домах для проживания студентов предоставляются на период обучения иногородним студентам.',
    category: 'dormitory',
    is_published: true
  },
  {
    id: 6,
    question: 'Как мне получить общежитие?',
    answer: 'При подаче документов вам необходимо указать в заявлении, что вы нуждаетесь в общежитии и представить заявление после решения мандатной комиссии о рекомендации Вас к зачислению.',
    category: 'dormitory',
    is_published: true
  },
  {
    id: 7,
    question: 'На сколько профилей подготовки (специальностей) можно подать заявление?',
    answer: 'Абитуриенты в своем заявлении могут указать до 3 конкурсных групп с указанием их приоритета с единым набором вступительных испытаний.',
    category: 'application',
    is_published: true
  },
  {
    id: 8,
    question: 'Обязательно ли предъявление подлинника документа об образовании при поступлении в Филиал?',
    answer: 'В соответствии с Правилами приёма в Филиал при подаче заявления о приеме в вуз абитуриент представляет оригинал и ксерокопию документа государственного образца об образовании.\n\nВ случае подачи документов в форме on-line, все документы предоставляются в отсканированной цветной форме в формате pdf или jpg и отправляются на электронную почту приёмной комиссии.',
    category: 'application',
    is_published: true
  },
  {
    id: 9,
    question: 'Сроки подачи документов?',
    answer: 'За сроками начала и окончания приёмной кампании следите за новостями на официальном телеграм-канале t.me/gubkin_uz и на странице официального сайта Филиала https://gubkin.uz/ru/sveden/priemnaya-komissiya',
    category: 'application',
    is_published: true
  },
  {
    id: 10,
    question: 'Нужно ли представлять в приемную комиссию медицинскую справку?',
    answer: 'Медицинская справка (по форме 086-У) с указанием полученных прививок предоставляется после поступления в Филиал.',
    category: 'documents',
    is_published: true
  },
  {
    id: 11,
    question: 'Какой период действительна медицинская справка формы 0-86?',
    answer: 'Медицинская справка формы 0-86 действительна в течение 6 месяцев.',
    category: 'documents',
    is_published: true
  },
  {
    id: 12,
    question: 'Есть ли в вузе военная кафедра и кому предоставляется отсрочка от службы в армии?',
    answer: 'Военной кафедры в Филиале нет, на время обучения предоставляется отсрочка от службы в армии для студентов, обучающихся в Филиале.',
    category: 'general',
    is_published: true
  },
  {
    id: 13,
    question: 'Предоставляется ли общежитие абитуриентам на время сдачи вступительных экзаменов в вузе?',
    answer: 'На время сдачи вступительных испытаний абитуриентам общежитие не предоставляется.',
    category: 'dormitory',
    is_published: true
  },
  {
    id: 14,
    question: 'Что значит степень бакалавра?',
    answer: 'Это первая академическая ступень в трехуровневой структуре высшего образования. Степень «бакалавр» - это базовое высшее образование. Нормативный срок обучения составляет 4 года. Диплом бакалавра дает право на работу по направлению и (или) поступление в магистратуру. Эта степень включена в международную классификацию, она понятна за рубежом.',
    category: 'study',
    is_published: true
  },
  {
    id: 15,
    question: 'Какие документы необходимо представить в приемную комиссию?',
    answer: 'Пакет необходимых документов вы можете посмотреть на странице официального сайта Филиала https://gubkin.uz/ru/sveden/neobhodimye-dokumenty',
    category: 'application',
    is_published: true
  },
  {
    id: 16,
    question: 'Нужно ли нотариально заверять копии документов?',
    answer: 'При подаче документов в Филиал Вы предоставляете нотариально заверенный перевод 1-й страницы паспорта на русский язык.',
    category: 'application',
    is_published: true
  },
  {
    id: 17,
    question: 'В каких случаях мои документы не примут?',
    answer: 'Если вы предоставили не полный пакет документов. При успешном приеме документов Вас об этом уведомит ответственный сотрудник приемной комиссии. В обратном случае рекомендуется обратиться в call-центр Филиала.',
    category: 'application',
    is_published: true
  },
  {
    id: 18,
    question: 'По итогам результатов мандатной комиссии, обязательно ли одному из родителей присутствовать при заключении договора на обучение на платно-контрактной основе?',
    answer: 'Да, обязательно.',
    category: 'application',
    is_published: true
  },
  {
    id: 19,
    question: 'Может ли один из родителей заключить договор без меня?',
    answer: 'Родитель или опекун сможет заключить договор без вашего присутствия, но только в том случае, если у него на руках будет нотариально заверенная доверенность от вас.',
    category: 'application',
    is_published: true
  },
  {
    id: 20,
    question: 'Можно ли гражданину Республики Узбекистан, являющегося студентом Российского ВУЗа оформить перевод в Филиал РГУ нефти и газа (НИУ) им.И.М.Губкина в г.Ташкенте на контрактной основе?',
    answer: 'Филиал РГУ нефти и газа (НИУ) имени И.М. Губкина в г.Ташкенте является структурным подразделением головного университета, т.е. РГУ нефти и газа (НИУ) имени И.М. Губкина в г.Москве. Все вопросы, связанные с переводом студентов из одного вуза в другой вуз Российской Федерации, регламентируется Порядком перевода обучающихся в другую организацию, осуществляющую образовательную деятельность по образовательным программам среднего профессионального и (или) высшего образования, утвержденного приказом министерства образования и науки Российской Федерации от 10 февраля 2017 г. N 124.',
    category: 'study',
    is_published: true
  },
  {
    id: 21,
    question: 'Можно ли члену сборной Узбекистана по спорту поступать в ваш ВУЗ и возможно ли совмещение спортивной и учебной деятельности?',
    answer: 'В филиале РГУ нефти и газа имени И.М. Губкина в г. Ташкенте обучается ряд студентов, являющихся членами сборных команд республики по слалому, восточным единоборствам и другим видам спорта. Все они успешно сочетают учебу и занятия спортом.',
    category: 'study',
    is_published: true
  },
  {
    id: 22,
    question: 'Можно ли студенту ВУЗа Республики Узбекистан поступать в магистратуру вашего Филиала?',
    answer: 'В филиале РГУ нефти и газа (НИУ) имени И.М. Губкина в г.Ташкенте обучение по программам магистратуры не осуществляется.',
    category: 'study',
    is_published: true
  },
  {
    id: 23,
    question: 'Есть ли для абитуриентов, имеющих инвалидность, льготы при поступлении в Филиал РГУ нефти и газа (НИУ) имени И.М.Губкина в г.Ташкенте?',
    answer: 'В филиале РГУ нефти и газа имени И.М. Губкина в г.Ташкенте льгот при поступлении для людей, имеющих инвалидность, не предусмотрены.',
    category: 'application',
    is_published: true
  }
]

export const defaultFaqContent = {
  title: 'Часто задаваемые вопросы',
  subtitle: 'Ответы на вопросы абитуриентов о поступлении в Филиал РГУ нефти и газа (НИУ) имени И.М. Губкина в городе Ташкенте',
  categories: defaultFaqCategories,
  items: defaultFaqs
}
